[
  {
    "bookId": 1,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/JKmRwsP/pngwing-1.png",
    "review": "A coming-of-age novel that captures the essence of teenage angst and rebellion. Salinger's narrative delves deep into the psyche of its protagonist, Holden Caulfield, as he navigates the complexities of adolescence and societal expectations. The raw honesty and authenticity of Caulfield's voice resonate with readers, making this a timeless classic that continues to resonate across generations.",
    "totalPages": 224,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Coming-of-age", "Literary Fiction"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 2,
    "bookName": "Why Do You Hate Money?",
    "author": "Scott Anderson",
    "image": "https://i.ibb.co/MB5cXRM/kindpng-7318921.png",
    "review": "A thought-provoking examination of people's dysfunctional relationship with money. Anderson skillfully dissects the psychological and societal factors that contribute to our attitudes toward wealth and finance. Through compelling anecdotes and insightful analysis, he challenges readers to confront their own beliefs and behaviors, offering a fresh perspective on the role of money in our lives.",
    "totalPages": 320,
    "rating": 4.5,
    "category": "Non-Fiction",
    "tags": ["Personal Finance", "Psychology"],
    "publisher": "HarperBusiness",
    "yearOfPublishing": 2020
  },
  {
    "bookId": 3,
    "bookName": "The Hate U Give",
    "author": "Angie Thomas",
    "image": "https://i.ibb.co/Zdjr9Rj/kindpng-1064993.png",
    "review": "A powerful and gripping novel addressing themes of racism, police brutality, and activism. Thomas's narrative unfolds with an emotional intensity that leaves a profound impact on readers. Through the lens of sixteen-year-old Starr Carter, the story navigates the complexities of identity, injustice, and the pursuit of justice. It's a timely and necessary contribution to young adult literature, sparking important conversations about race and equality.",
    "totalPages": 464,
    "rating": 4.7,
    "category": "Young Adult",
    "tags": ["Social Justice", "Contemporary"],
    "publisher": "Balzer + Bray",
    "yearOfPublishing": 2017
  },
  {
    "bookId": 4,
    "bookName": "The Scholarship Monthly Planner",
    "author": "Amanda M. Blair",
    "image": "https://i.ibb.co/5Lyt4yt/kindpng-4022054-1.png",
    "review": "A comprehensive planner designed to help students organize and track scholarship applications. Blair provides invaluable tools and resources for students seeking financial assistance for their education. From deadline tracking to essay brainstorming, this planner streamlines the scholarship application process, empowering students to pursue their academic aspirations with confidence and efficiency.",
    "totalPages": 150,
    "rating": 4.0,
    "category": "Education",
    "tags": ["Study Aid", "Organization"],
    "publisher": "Independently Published",
    "yearOfPublishing": 2022
  },
  {
    "bookId": 5,
    "bookName": "Annotated Texas Family Code 2009",
    "author": "Thomson Reuters",
    "image": "https://i.ibb.co/0j3G2xY/kindpng-81724-1.png",
    "review": "A detailed and annotated reference guide to the Texas Family Code. Thomson Reuters presents a comprehensive resource for legal professionals and individuals navigating family law in Texas. With meticulous annotations and up-to-date information, this guide offers clarity and insight into the nuances of family law, serving as an indispensable companion for legal research and practice.",
    "totalPages": 600,
    "rating": 4.3,
    "category": "Legal",
    "tags": ["Law", "Reference"],
    "publisher": "West Academic Publishing",
    "yearOfPublishing": 2009
  },
  {
    "bookId": 6,
    "bookName": "Loving Jesus More",
    "author": "Philip Graham Ryken",
    "image": "https://i.ibb.co/7JgCQJ7/kindpng-2193744-1.png",
    "review": "An inspirational guide to deepening one's love and devotion to Jesus Christ. Ryken's profound insights and spiritual wisdom illuminate the path to a richer, more intimate relationship with Christ. Through practical advice and heartfelt encouragement, this book empowers believers to cultivate a deeper understanding of their faith and a more profound connection with the Savior.",
    "totalPages": 240,
    "rating": 4.6,
    "category": "Religion",
    "tags": ["Christian Living", "Spirituality"],
    "publisher": "Crossway",
    "yearOfPublishing": 2001
  },
  {
    "bookId": 7,
    "bookName": "The Lost Art of Good Conversation",
    "author": "Sakyong Mipham",
    "image": "https://i.ibb.co/gwPyw4Z/kindpng-5624060-1.png",
    "review": "A thoughtful exploration of the importance of meaningful human interaction in the digital age. Mipham's reflections on communication and connection offer invaluable guidance for navigating the complexities of modern relationships. Drawing from mindfulness practices and personal anecdotes, he emphasizes the transformative power of authentic conversation, inspiring readers to cultivate deeper connections in an increasingly disconnected world.",
    "totalPages": 224,
    "rating": 4.4,
    "category": "Self-Help",
    "tags": ["Communication", "Social Skills"],
    "publisher": "Harmony",
    "yearOfPublishing": 2017
  },
  {
    "bookId": 8,
    "bookName": "Cold-Case Christianity",
    "author": "J. Warner Wallace",
    "image": "https://i.ibb.co/XLf9GTY/kindpng-2592315-1.png",
    "review": "An intriguing investigation into the historical evidence for Christianity. Wallace meticulously examines the claims of the Christian faith through the lens of a cold-case detective, presenting compelling arguments for its validity. Drawing from archaeological findings, eyewitness accounts, and logical reasoning, he constructs a compelling case for the historical reliability of the Gospels, inviting skeptics and believers alike to engage with Christianity in a new light.",
    "totalPages": 336,
    "rating": 4.8,
    "category": "Religion",
    "tags": ["Apologetics", "Christianity"],
    "publisher": "David C. Cook",
    "yearOfPublishing": 2013
  },

  {
    "bookId": 9,
    "bookName": "Spine of the Dragon",
    "author": "Kevin J. Anderson",
    "image": "https://i.ibb.co/RzRjkCY/kindpng-4945926-1.png",
    "review": "An epic fantasy novel set in a world of magic, politics, and intrigue. Anderson weaves a rich tapestry of adventure and suspense, drawing readers into a meticulously crafted realm filled with dragons, heroes, and dark forces. With intricate world-building and dynamic characters, 'Spine of the Dragon' delivers an immersive reading experience that will captivate fans of the fantasy genre.",
    "totalPages": 576,
    "rating": 4.5,
    "category": "Fantasy",
    "tags": ["Epic", "Adventure"],
    "publisher": "Tor Books",
    "yearOfPublishing": 2018
  }
]
